app/views/posts/show.html.erb

      <div class="commentContents">
        <% if comment.user.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (2)