app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["post_id", 1], ["body", "test"], ["created_at", "2016-06-29 17:57:28.180259"], ["updated_at", "2016-06-29 17:57:28.180259"]]

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]