app/controllers/posts_controller.rb

  def index
    @posts = Post.all

    if params[:keyword].present?
       @posts = @posts.get_by_keyword params[:keyword]
    end

    if params[:shop].present?
       @posts = @posts.get_by_name params[:shop]
    end

    if params[:area].present?
      @posts = @posts.search_values_or(:area, params[:area])
    end

    if params[:genre].present?
      @posts = @posts.search_values_or(:genre, params[:genre])
    end

    if params[:rate_l].present?
       @posts = @posts.get_by_rate_l params[:rate_l]
    end

    if params[:rate_u].present?
       @posts = @posts.get_by_rate_u params[:rate_u]
    end

    @posts = @posts.page(params[:page])
---
SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE (("posts"."shop" LIKE '%関%' OR "posts"."area" LIKE '%関%') OR "posts"."genre" LIKE '%関%') AND ("posts"."area" LIKE '%八丁堀%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (("posts"."shop" LIKE '%関%' OR "posts"."area" LIKE '%関%') OR "posts"."genre" LIKE '%関%') AND ("posts"."area" LIKE '%八丁堀%')

  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.includes(:user).all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "area" = ?, "genre" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["area", "八丁堀/銀座/丸の内"], ["genre", "フレンチ/イタリアン"], ["updated_at", "2016-06-29 11:11:37.126310"], ["id", 2]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]